add architecutre
